Repository: Kyons-VN/kyons_flutter
Catalog: lib/src/localization/app_*.arb
Languages: vi

source: Welcome back!
vi: Mừng bạn quay trở lại!

# knowledgeStart
source: Knowledge starts from “Why”?
vi: Tri thức khởi đầu từ “Tại sao”?

source: Login Success
vi: Đăng nhập thành công

# beforeStart
source: Before starting the journey ...
vi: Trước khi bắt đầu hành trình...

# kyonsNeeds
source: Kyons needs some basic information to understand you better!
vi: Kyons cần một vài thông tin cơ bản để hiểu bạn hơn nhé!

# noteYouCanChange
source: Note: You can change this information later.
vi: Lưu ý: Bạn có thể thay đổi thông tin này sau.

# yourBirthdate
source: Your birthday
vi: Ngày sinh của bạn

source: Your grade
vi: Khối lớp của bạn

source: Grade 10
vi: Lớp 10

source: Grade 11
vi: Lớp 11

source: Grade 12
vi: Lớp 12

# whatIsSchool
source: Which school are you studying?
vi: Bạn đang học trường nào

# schoolPlaceholder
source: Example: Nguyen Thuong Hien High School
vi: VD: THPT Nguyễn Thượng Hiền

# whereIsYourAddress
source: The city where you live?
vi: Thành phố nơi bạn sinh sống?

# phone
source: Phone number
vi: Số điện thoại

source: Password
vi: Mật khẩu

source: Birthdate
vi: Ngày sinh

source: Sign in
vi: Đăng nhập

source: Sign out
vi: Thoát

source: Sign up
vi: Đăng ký

source: Language
vi: Ngôn ngữ

source: Invalid {thing}!
vi: {thing} chưa đúng!

source: Settings
vi: Cài đặt

source: Theme mode
vi: Chế độ sáng tối

# themeModeSystem
source: System
vi: Theo hệ thống

source: Light mode
vi: Nền sáng

# dartMode
source: Dark mode
vi: Nền tối

# languageName
source: English
vi: Tiếng Việt

source: Success
vi: Thành công

source: Fail
vi: Không thành công

source: Back
vi: Trở về

source: Hello!
vi: Xin chào!

source: Shortcuts
vi: Lối tắt

# continueLastSession
source: Continue to study last session
vi: Tiếp tục học bài trước đó

source: Your Attributes
vi: Chỉ số của bạn

# whatAreThese
source: What are these indicators?
vi: Những chỉ số này là gì?

# secrectFeature
source: The secret feature is about to be revealed 🥳
vi: Tính năng bí mật sắp được bật mí 🥳

# recentGoal
source: Recent goals
vi: Mục tiêu gần đây

source: See all goals
vi: Xem tất cả Mục tiêu

# createNewGoal
source: Create new learning goals
vi: Tạo mục tiêu học tập mới

# noGoal
source: You do not have a study goal!
vi: Bạn chưa có Mục tiêu học tập!

# kyonsNeedToKnow
source: Kyons needs to know the learning goals to create exercises that fit your level.Click this button to
vi: Kyons cần biết mục tiêu học tập để tạo ra bài tập vừa với trình độ của bạn. Bấm vào nút này để

# createFirstGoal
source: Create the first learning goal!
vi: Tạo mục tiêu học tập đầu tiên nhé!

# chooseSubjectAndProgram
source: Choose your subject and program
vi: Bạn hãy chọn môn và chương trình học

# chooseSubjectAndProgramHeadline
source: Choose subject and program
vi: Chọn môn & chương trình học

source: Select {thing}
vi: Chọn {thing}

source: Subject
vi: Môn

source: Math
vi: Toán

source: English
vi: Tiếng Anh

source: Start
vi: Bắt đầu

source: Back to home
vi: Về trang chủ

source: Back to login
vi: Về trang đang nhập

# doDiagnostictestHeading
source: Will have a diagnostictest!
vi: Làm bài khảo sát trước nhé!

# doDiagnostictestBtn
source: Start diagnostic test
vi: Làm bài khảo sát trình độ

# doDiagnostictestCancel
source: No, just let me in!
vi: Thôi, không cần đâu!

source: Diagnostic test
vi: Bài khảo sát

source: Question
vi: Câu hỏi

source: Lesson
vi: Bài học

# questionNumber
source: Question
vi: Câu

# lessonNumber
source: Lesson
vi: Bài

source: Home
vi: Trang chủ

source: Learning Path
vi: Lộ trình học

# cancelRequest
source: Cancel
vi: Hủy yêu cầu

# callTutor
source: Call tutor for help?
vi: Gọi gia sư hỗ trợ nhé?

# connectingTutor
source: Tutor is connecting. Please wait for a few minute.
vi: Kyons đang kết nối với gia sư. Bạn vui lòng đợi trong ít phút.

# tutorReady
source: Tutor is ready. Click button "Meet tutor" to connect with him/her.
vi: Gia sư đã sẵn sàng. Nhấn vào nút "Gặp gia sư" để kết nối với gia sư.

source: Meet tutor
vi: Gặp gia sư

source: Exercise
vi: Bài tập

source: Test
vi: Kiểm tra

source: Level
vi: Cấp độ

source: Your score
vi: Điểm của bạn

source: General knowledge
vi: Tổng quan kiến thức

# knowledgeShouldReview
source: Knowledge to review
vi: Kiến thức cần xem lại

source: Redo exercise
vi: Làm lại bài tập

source: Do test
vi: Làm bài kiểm tra

# error
source: Error, please try again later
vi: Có lỗi, vui lòng thử lại sau

source: To learning path
vi: Đến giáo trình

# finishTest
source: You have finished testing
vi: Bạn đã hoàn thành bài kiểm tra

# learningPathIsReparing
source: Kyons is reparing learning path for you. Please wait!
vi: Kyons đang chuẩn bị giáo trình cho bạn. Xin vui lòng đợi!

# learningPathIsReady
source: Kyons has created learing path for you. Let''s get started!
vi: Kyons đã chuẩn bị xong giáo trình cho bạn. Bắt đầu học thôi nào!

source: Hi {so}
vi: Chào {so}

# lessonIsReparing
source: Kyons is reparing the lesson for you
vi: Kyons đang chuẩn bị bài học cho bạn

# newLesson
source: Create new lesson
vi: Tạo bài học mới

source: Press (
vi: Nhấn (

# toAddKnowledge
source: ) to add knowledge to your lesson
vi: ) để đưa kiến thức vào bài học

source: Create lesson
vi: Tạo bài học

# selectedKnowledgeCount
source: {count, plural, zero{No selected knowledge} one{1 knowledge is selected} other{{count} knowledge are selected}}
vi: {count, plural, zero{Chưa chọn kiến thức} one{1 kiến thức được chọn} other{{count} kiến thức được chọn}}

source: Forgot password?
vi: Quên mật khẩu?

source: Does not have account?
vi: Bạn chưa có tài khoản?

source: Register here
vi: Đăng ký tại đây

source: First name
vi: Tên

source: Last name
vi: Họ

source: Enter email
vi: Nhập email của bạn

source: Enter password
vi: Nhập mật khẩu

# iAgreePrivacy
source: I agree with Kyons''s terms and conditions. See the terms and conditions of use at
vi: Tôi đồng ý với điều kiện và điều khoản sử dụng của Kyons. Xem điều kiện và điều khoản sử dụng tại

# linkHere
source: here
vi: đây

source: create_account
vi: Tạo tài khoản

source: Already have account?
vi: Đã có tài khoản?

source: Password must have
vi: Mật khẩu phải có

# passwordValidateMin
source: Have more than 8 characters
vi: Từ 8 ký tự trở lên

# passwordValidateUpper
source: Upper case (A-Z)
vi: Ký tự viết hoa (A-Z)

# passwordValidate_0
source: Digit (0-9)
vi: Ký tự số (0-9)

# passwordValidateSpecial
source: Special (~!@#$%^&*_-+=`'{'|'}'[]:;"''<>,.?/)
vi: Ký tự đặt biệt (~!@#$%^&*_-+=`'{'|'}'[]:;"''<>,.?/)

# emailAlreadyUsed
source: Email already in the system
vi: Email đã có trong hệ thống

# pleaseCheckCodeInEmail
source: Please check code send to email {email}
vi: Vui lòng nhập mã gửi đến email {email}

source: Code
vi: Mã code

# sendMeCode
source: Send me the code
vi: Gửi tôi mã code

source: Change password
vi: Đặt lại mật khẩu

source: Email not found
vi: Không tìm thấy email

# enterEmailToGetCode
source: Enter your email to get code
vi: Nhập email của bạn để nhận mã thay đổi mật khẩu

source: codeIsSend.
vi: Mã code đã được gửi đến email của bạn. Kiểm tra email và nhập mã vào ô bên dưới.

# selectLearningGoalTitle
source: Choose a study program
vi: Chọn chương trình học

# selectLearningGoalDesc
source: Choose your subject and program of study, then choose the specific goal you want to achieve
vi: Bạn hãy chọn môn và chương trình học, sau đó chọn mục tiêu cụ thể mà bạn muốn đạt được

source: Select subject
vi: Chọn môn

source: Select program
vi: Chọn chương trình

# selectLearningGoal
source: Learning goal
vi: Mục tiêu học tập

source: Select content
vi: Chọn nội dung

# selectContentDesc
source: Select {min} - {max} content you want to learn
vi: Bạn chọn từ {min} - {max} bài để ôn tập nhé

source: Mock test
vi: Bài kiểm tra

source: Target
vi: Mục tiêu

source: Mock test point
vi: Điểm bài kiểm tra

source: Your point
vi: Điểm của bạn

source: Compare with target
vi: So sánh với mục tiêu

# thisIsTheMockTestResult
source: Here are the results of the entrance test. Kyons will rely on this result to create many exercises to reinforce the missing knowledge. Let''s start studying with Kyons.
vi: Đây là kết quả bài kiểm tra đầu vào. Kyons sẽ dựa vào kết quả này tạo nên nhiều bài tập củng cố kiến thức còn thiếu. Hãy bắt đầu học cùng Kyons nhé.

# continueDoingExercise
source: Continue doing exercises
vi: Tiếp tục làm bài tập

# challengeYourFriends
source: Challenge your best friend to receive a gift!
vi: Thách thức bạn thân nhận quà!

# giftFromKyons
source: Receive gifts from Kyons when sending quizzes to friends
vi: Nhận quà từ Kyons khi gửi bài kiểm tra cho bạn bè

# easyMockTest
source: Is the mock test too easy?
vi: Bài khảo sát quá dễ?

# reselectTarget
source: You can re-select your learning goal
vi: Bạn có thể lựa chọn lại mục tiêu học tập

# shareYourThoughts
source: Share your experience end receiving gifts from Kyons!
vi: Chia sẻ trải nghiệm nhận quà từ Kyons!

# aFewMinutes
source: Take a few minutes to take a few minutes to survey so that Kyons can understand more about you and your learning needs. In return, we also have interesting and unexpected gifts for you.
vi: Dành ít phút cho dăm câu khảo sát để Kyons có thể hiểu thêm về bạn và nhu cầu học tập của bạn nhé. Đổi lại chúng mình cũng có những phần quà thú vị bất ngờ dành tặng bạn đó.

source: Nevermind!
vi: Thôi bỏ đi!

# shareMockTest
source: Share the challenge and receive gift!
vi: Chia sẻ thử thách nhận quà!

# testFormat
source: <p>You can share mock test with your friends and invite them to join Kyons.</p><ul><li>For each successful registration and activation email, you will be rewarded with <strong >1 test and 36 hours of free lessons</strong>.</li><li>From the 6th email of successful registration, you will receive <strong>1 week of free lessons and 1 counseling package. with a tutor</strong> (up to 30 minutes)</li></ul><p></p><p><strong>Note:</strong> the challenge sharing program is only valid treat those who accept the challenge without a Kyons account.</p>
vi: <p>Bạn có thể chia sẻ các bài kiểm tra với bạn bè và mời họ cùng tham gia Kyons.</p><ul><li>Với mỗi email đăng ký và kích hoạt thành công, bạn sẽ được tặng <strong>1 bài kiểm tra và 36 giờ học không tính phí</strong>.</li><li>Từ email thứ 6 đăng ký thành công, bạn sẽ nhận được <strong>1 tuần học miễn phí và 1 gói tư vấn cùng gia sư</strong> (tối đa 30 phút)</li></ul><p></p><p><strong>Lưu ý:</strong> chương trình chia sẻ thử thách chỉ có giá trị với các bạn nhận thử thách mà chưa có tài khoản Kyons.</p>

source: National program
vi: Chương trình quốc gia

source: To destination
vi: Tới đích

source: Change direction
vi: Chuyển hướng

source: To {st}
vi: Đến {st}

# categoryCompleted
source: Congratulations on completing the {category_name} section
vi: Chúc mừng bạn hoàn thành phần {category_name}

# categoryCompletedDesc
source: You did a great job already! Continue learning the rest to complete your goal! You can study the course selection by clicking on the map on the syllabus page anytime you want.
vi: Bạn đã làm rất tốt rồi! Tiếp tục học những phần còn lại để hoàn thành mục tiêu của bạn nhé! Bạn có thể học lựa chọn phần học bằng cách click vào bản đồ ở trang giáo trình bất cứ lúc nào bạn muốn.

source: Learned knowledge
vi: Các kiến thức đã học

# subscriptionExpired
source: Your subscription has expired.
vi: Bạn đã hết gói bài học

# subscriptionExpiredDesc
source: To create a new lesson, you need to purchase additional Kyons''s subscription!
vi: Để tạo bài học mới, bạn cần mua thêm gói bài học của Kyons nhé!

source: Buy package
vi: Mua gói

# notChangeTarget
source: Don''t change your target
vi: Không đổi mục tiêu

# doYouWantToStop
source: Do you want to stop the test?
vi: Bạn có chắc muốn dừng lại?

# youWillHaveTo
source: You will have to start the test from the beginning
vi: Bạn sẽ phải làm lại bài kiểm tra từ đầu nếu bạn muốn dừng làm làm kiểm lúc này.

# continueText
source: Continue
vi: Tiếp tục

source: Stop
vi: Dừng

source: Close dialog
vi: Đóng thông báo

# ranOutMockTest
source: Ran out of mock test
vi: Bạn đã sử dụng hết bài kiểm tra!

# ranOutMockTestDesc
source: To create a new goal, you need to purchase additional Kyons''s service packs.
vi: Để tạo mục tiêu mới, bạn cần mua thêm gói dịch vụ Kyons.

# thisIsTestResult
source: Here are the test results. Please continue to study with Kyons to complete your learning goals!
vi: Đây là kết quả bài kiểm tra. Bạn hãy tiếp tục học cùng Kyons để hoàn thành mục tiêu học tập nhé!

source: Copied to clipboard
vi: Đã sao chép vào clipboard

# youWillUse
source: You will use Kyons''s service
vi: Bạn sẽ sử dụng dịch vụ Kyons

# toCreateLearningGoal
source: <p>To create a new goal, you will use <strong>a Kyos test</strong>.</p><p>When creating a new goal, Kyons will change the syllabus to match the results. your new test results.</p>
vi: <p>Để tạo mục tiêu mới, bạn sẽ dùng <strong>một bài kiểm tra Kyons</strong>.</p><p>Khi tạo mục tiêu mới, Kyons sẽ thay đổi giáo trình lại cho phù hợp với kết quả bài kiểm tra mới của bạn.</p>

source: Change target
vi: Đổi mục tiêu

# freeTrial
source: You are given 7 free days with Kyons!
vi: Bạn được tặng 7 ngày học miễn phí cùng Kyons!

# freeTrialDesc
source: <p>Short lessons, selective exercises and a learning route designed by Kyons based on your own learning goals waiting ahead.</p><p>Let''s Kyons!</p>
vi: <p>Bài học ngắn gọn, bài tập chọn lọc và một lộ trình học được Kyons thiết kế dựa trên mục tiêu học tập của riêng bạn đang chờ ở phía trước.</p><p>Còn chần chừ gì mà chưa học cùng Kyons nào!</p>

# startLearing
source: Start learning
vi: Bắt đầu học

source: Processing
vi: Đang xử lý

source: day
vi: ngày

# dayNum
source: 1 day
vi: 1 ngày

# daysNum
source: {num} days
vi: {num} ngày

source: minute
vi: phút

# minuteNum
source: 1 minute
vi: 1 phút

# minutesNum
source: {num} minutes
vi: {num} phút

# second
source: giây
vi: second

# secondNum
source: 1 giây
vi: 1 second

# secondsNum
source: {num} giây
vi: {num} seconds

source: Profile
vi: Hồ sơ cá nhân

# userInfo
source: Personal information
vi: Thông tin cá nhân

# deleteAccount
source: Delete the account
vi: Xóa tài khoản

# deleteAccountDesc
source: When deleting your account, learning process and results will not be saved.All account balances and services you have will not be refunded.Are you sure to delete your account?
vi: Khi xoá tài khoản, quá trình học và kết quả của bạn sẽ không được lưu lại. Tất cả số dư tài khoản và dịch vụ mà bạn đang có sẽ không được hoàn tiền. Bạn có chắc muốn xoá tài khoản?

# account
source: Kyons account
vi: Tài khoản Kyons

source: Your account
vi: Tài khoản của bạn

source: Transaction history
vi: Lịch sử giao dịch

# yourServices
source: Your service
vi: Dịch vụ của bạn

# selectProfilePicture
source: Choose avatar
vi: Chọn ảnh đại diện

# selectProfilePictureDesc
source: JPG format, png, no more than 1MB
vi: Định dạng JPG, PNG, không quá 1MB

# updateUserInfo
source: Update personal information
vi: Cập nhật thông tin cá nhân

source: Enter old password
vi: Nhập mật khẩu cũ

source: Enter new password
vi: Nhập mật khẩu mới

source: Confirm new password
vi: Nhập lại mật khẩu mới

source: New password
vi: Mật khẩu mới

source: Confirm password
vi: Mật khẩu xác nhận

# takeProfilePicture
source: Take a picture
vi: Chụp ảnh đại diện

source: Select image from gallery
vi: Chọn ảnh trong album

# emptyData
source: No data
vi: Chưa có dữ liệu

# balance
source: Money in the account
vi: Tiền trong tài khoản

# tutorSuggestions
source: Consulting tutor
vi: Gia sư tư vấn

source: Learning package
vi: Gói học tập

source: Buy more
vi: Mua thêm

# leftSt
source: Have {st}
vi: Còn {st}

# kyonsPackages
source: Service package of Kyons
vi: Gói dịch vụ của Kyons

# depositToAccount
source: Deposit money into your account
vi: Nạp tiền vào tài khoản

# bankTransferHtml
source: <h6>Bank transfer</h6><p>Transfer to deposit money into the account, with notes:<br /><strong> [Your email] - Kyons Credit</strong></p><p>Bank<br /><strong>Techcombank</strong></p><p>Account number<br /><strong> 19037780961051</strong></p><p>Account holder''s name<br /><strong>Kyons Company Limited</strong></p>
vi: <h6>Chuyển khoản ngân hàng</h6><p>Chuyển khoản để nạp tiền vào tài khoản, kèm ghi chú:<br /><strong>[Email của bạn] - Kyons credit</strong></p><p>Ngân hàng<br /><strong>Techcombank</strong></p><p>Số tài khoản<br /><strong>19037780961051</strong></p><p>Tên chủ tài khoản:<br /><strong>Công Ty TNHH Kyons</strong></p>

# canNotBuyPackage
source: Can''t buy package
vi: Không thể mua gói

# canNotBuyPackageDesc
source: Your account does not currently have enough balance to pay.Please add more money to Kyons
vi: Tài khoản của bạn hiện không đủ số dư để thanh toán. Vui lòng nạp thêm tiền vào Kyons

source: Quantity
vi: Số lượng

source: Total price
vi: Tổng giá tiền

source: Confirm
vi: Xác nhận

source: Cancel
vi: Hủy

# numberTypeError
source: Please enter the number
vi: Vui lòng nhập ký tự số

# youCanBuyOnlyNumberPackage
source: You can only buy maximum {number} package(s)
vi: Bạn chỉ có thể mua tối đa {number} gói

# buySuccess
source: Buy package successfully!
vi: Mua gói thành công!

# buySuccessDesc
source: You just bought {number} {name}<br />Your order number is<br /><strong>{orderNumber}</strong>
vi: Bạn vừa mua {number} {name}<br />Mã số đơn hàng của bạn là <br /><strong>{orderNumber}</strong>

source: User manual
vi: Hướng dẫn sử dụng

source: Please try again
vi: Bạn thử lại nhé

source: Payment
vi: Thanh toán
